# SaveOrientationAndLock Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View3D..::..SaveOrientationAndLock Method
View3D Class See Also
---
Locks the view and saves its orientation
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SaveOrientationAndLock()
```

Visual Basic
---
```text
Public Sub SaveOrientationAndLock
```

Visual C++
---
```text
public:
void SaveOrientationAndLock()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Returns true if the view is not a view template. -or- The orientation of the View3D cannot be saved. |

# See Also
View3D Class
Autodesk.Revit.DB Namespace